[
{"pythonque": ["1) What is Python?", "2) What are the benefits of Python?", "3) What are the key features of Python?", "4) What type of language is Python? Programming or Scripting?", "5) What are the applications of Python?", "6) What is the difference between list and tuple in Python?", "7) What are the global and local variables in Python?", "8) Define PYTHON PATH?", "9) What are the two major loop statements?", "10) What do you understand by the term PEP 8?", "11) How memory management is done in Python?", "12) Java vs Python", "13) Define modules in Python?", "14) What are the built-in types available in Python?", "15) What are Python Decorators?", "16) How do we find bugs and statistical problems in Python?", "17) What is the difference between .py and .pyc files?", "18) How do you invoke the Python interpreter for interactive use?", "19) Define String in Python?", "20) What do you understand by the term namespace in Python?", "21) How do you create a Python function?", "22) Define iterators in Python?", "23) How does a function return values?", "24) Define slicing in Python?", "25) How can Python be an interpreted language?", "26) What happens when a function doesn’t have a return statement? Is this valid?", "27) Define package in Python?", "28) How can we make a Python script executable on Unix?", "29) Which command is used to delete files in Python?", "30) Define pickling and unpickling in Python?", "31) Explain the difference between local and global namespaces?", "32) What is a boolean in Python?", "33) What is Python String format and Python String replace?", "Python Coding Interview Questions & Examples:", "63Q. What is Django?", "64Q. List the features of Django?", "65Q. Which level framework does Django belong to?", "66Q. What are the advantages of Django?", "67Q. Why should we use Django framework?", "68Q. List the common security issues that can be avoided by using Django?", "69Q. List a few of the famous companies that are using Django?", "70Q. What can we do with the Django framework?", "71Q. List steps for setting up static files in Django?", "72Q. Is Django stable?", "73Q. Differentiate Django reusability code with other frameworks?", "74Q. How can we handle URLs in Django?", "75Q. List the mandatory files if Django project?", "76Q. Explain about Django session?", "77Q. Why do we use a cookie in Django?", "78Q. Mentions the methods used for setting and getting cookie values?", "79Q. What is the use of Django-admin.py?", "80Q. What is the use of manage.py?", "81Q. Why is Django loosely packed?", "82Q. List the ways we add view functions to urls.py?", "Python OOPS Concepts:", "1Q. What is the best Python IDE for beginners?", "2Q. What are the cool things you can do with Python?", "3. Does Python replace Java?", "4. How do I prepare for Python interview?", "5. Why should you choose Python?", "6. Can we use Python for coding in interviews?", "7. How to crack a coding interview?", "8. Top 5 tips to crack the interview?", "9. How can I practice code?", "10. How to crack my first interview?"]},
{"javaque": ["Q1. What is Java?", "Q2. Explain in brief the history of Java?", "Q3. What is the difference between C and Java?", "Q4. What is the reason why Java came into existence?", "Q5. Compare both C++ and Java?", "Q6. What are the prominent features of Java?", "Q7. What is a Class in Java?", "Q8. Define Object in Java?", "Q9. How to write a basic Hello World program in Java?", " Q10. Define JVM?", "Q11. Name the memory areas that are allocated by JVM and explain about class loader in JVM?", "Q12. What is JDK?", "Q13. What do you mean by JRE?", "Q14. What is the significant difference between  JVM, JRE, and JDK?", "Q15. Define JIT compiler in Java?", "Q16. Define variables in Java and explain with example?", "Q17. What are the different types of variables in Java?", "Q18. What is typecasting?", "Q19. What is type conversion?", "Q20. What are the data types in Java?", "Q21. What are primitive data types?", "Q22. What are the default values and sizes of primitive data types?", "Q23. What are non-primitive data types?", "Q24. Why char uses 2 bytes in Java and what is this ‘u0000’ notation called?", "Q25. Write the syntax for object declaration in Java?", "Q26. What is Unicode system?", "Q27. Why Java uses Unicode System?", "Q28. What makes Java as ‘Run Anywhere’ in nature?", "Q29. Is exit, null, delete, main, and next are the keywords in Java?", "Q30. What if we write public static void as static public void?", "Q31. Is there any default value for local variables?", "Q32. How many types of operators are available in Java?", "Q33. What is operator precedence in Java?", "Q34. What are the different logical operators in Java?", "Q35. What is the role of the unary operator in Java?", "Q36. What is the difference between ++a and a++ increment operators?", "Q37. Define left shift and right shift operators in Java?", "Q38. What are the bitwise operators in Java?", "Q39. What is a ternary operator?", "Q40. Is Empty .java file is a valid source file name?", "Q41. What are Java keywords?", "Q42. What are various access specifiers present in Java?", " Q43. What are the advantages of packages in Java?", "Q44. What is the output of the following program?", "Q45. List out the control statements in Java?", "Q46. What are the selection statements in Java?", "Q47. What are the different types of iterative statements?", "Q48. What are the jump statements in Java?", "Q49. Define for each loop in Java?", "Q50. What is the difference between a while loop and do-while loop", "Q51. What are the comments in Java?", "Q52. Describe in brief about OOPs concepts?", "Q53. What is Abstraction?", "Q54. Define encapsulation?", "Q55. What is Inheritance in Java?", "Q56. What is Polymorphism in Java?", "Q57. What are the advantages of OOPs?", "Q58. What is the major difference between object-oriented language and object-based language?", "Q59.  What will be an initial value for an object reference which is defined as an instance variable?", "Q60. What is the Object-oriented paradigm?", "Q61. What are Java naming conventions?", "Q62. What are the rules we need to follow to declare a class?", "Q63. Define Constructor in Java?", "Q64. What all the rules must be followed while creating a constructor in Java?", "Q65. What are the different types of constructors available in Java?", "Q66. Give examples for both default constructor and parameterized constructor?", "Q67. Does constructor return any value?", " Q68.  Can the constructor be inherited?", " Q69. Can the constructor be overloaded?", "Q70. Can we declare a constructor as final?", "Q71. Is there any Constructor class available in Java and what is the purpose of it?", " Q72. What is the use of copy constructor in Java?", "Q73. Define the method in Java?", "Q74. Difference between constructor and method?", "Q75. What is the method signature in Java?", "Q76. What is the role of static keyword in Java?", "Q77. What is a static variable?", "Q78. What happens if we declare a method as a static?", "Q79. What are the cons observed if we declare a method as static in Java?", "Q80. Why is the main method in Java is static?", "Q81. Can we override static method in Java?", "Q82. What is a static block in Java?", "Q83. Can we execute a program in Java without main() method?", "Q84. What happens if we remove static modifier from the signature of the main() method?", "Q85. Can we declare constructor using static?", "Q86. Can we make abstract methods as static in Java?", "Q87. Can we declare static methods and variables in the abstract class?", "Q88. Define this keyword in Java?", "Q89. What is the usage of this keyword in Java?", " Q90. Can this keyword be used to refer to the current class instance variable?", "Q91. Which class is the superclass for all the classes in Java?", "Q92. What is a singleton class in Java?", "Q93. Why we use inheritance in Java?", "Q94. Write the syntax for inheritance in Java?", "Q95. How can we generate random numbers in Java?", "Q96. Can the main() method in Java return any data?", "Q97. What are Java packages?", "Q98. What is the reason why multiple inheritance is not supported in Java?", "Q99. Can we declare the main() method of our class as private?", "Q100. Can a class in Java have multiple constructors?", "Q101. What is the method overloading in Java?", "Q102. What are the different ways to overload a method?", "Q103. Write a program to demonstrate the method overloading by changing data types?", "Q104. Write a program to demonstrate the method overloading by changing a number of arguments?", "Q105. Why method overloading is not possible only by changing the return type of method only?", "Q106. Can we overload main() method in Java?", "Q107. What is method overriding in Java?", "Q108. What is the usage of method overriding in Java?", "Q109. What are the rules we need to follow during method overriding?", "Q110. Write a program to demonstrate method overriding?", "Q111. Can we override a static method?", "Q112. Can we override a main() method in Java?", "Q113. What is the difference between aggregation and composition?", "Q114. Why does Java not support pointers?", "Q115. What is the super keyword in Java?", "Q116. What is the usage of super keyword in Java?", "Q117. Can we have virtual functions in Java?"]},
{"nodejsque": ["What is Node.js? Where can you use it?", "Why use Node.js?", "What are the features of Node.js?", "How else can the JavaScript code below be written using Node.Js to produce the same output?", "How do you update NPM to a new version in Node.js?", "Why is Node.js Single-threaded?", "Explain callback in Node.js.", "What is callback hell in Node.js?", "How do you prevent/fix callback hell?", "Explain the role of REPL in Node.js.", "Name the types of API functions in Node.js.", "Which is the first argument typically passed to a Node.js callback handler?", "What are the functionalities of NPM in Node.js?", "What is the difference between Node.js and Ajax?", "Explain chaining in Node.js.", "What are “streams” in Node.js? Explain the different types of streams present in Node.js.", "What are the exit codes in Node.js? List some exit codes.", "What are Globals in Node.js?", "What is the difference between AngularJS and Node.js?", "Why is consistent style important, and what tools can be used to assure it?"]}
]